


ru = {

    'teacher_welcome_message': '''Вы перешли в раздел учителя.

Здесь вам доступна вся информация о ваших группах, курсах.
**Мои курсы** - Список созданных вами курсов
**Мои Группы** - Список ваших групп со студентами
**Создать новый курс** - Меню создания нового курса
**Загрузить файлы на сервер** - Загрузка файлов на сервер(максимальный объем 100мб)
**Настройки** - Информация о преподавате, которую вы можете редактировать
''',
    "my_courses": 'мои курсы',
    'course': 'Курс {} \n\n {}',
    'my_groups': 'Мои группы',
    'group': 'Группа: {}',
    'send_message_to_students': "Отправить сообщение студентам",
    'get_course_code': 'Ваш код группы: {}',
    'student_list': 'Список студентов {}',
    'teacher_report': '''
Открыто тем: {}
Выполнено заданий: {}% 
Кол-во студентов не выполнивших задание: {}
''',
    'student': '{} \n\nВыполнено тем:{}\n\nВыполнено заданий:{}\n\nКол-во баллов:{}',
    'change_course_group': 'Выберите курс для группы',
    'course_for_group': '1. добавить этот курс к группе\n2. Создать новый курс на основе этого и добавить иго к группе',
    'add_this_course': 'Курс {} добавлен К группе {}',
    'add_course_as_new': 'Новый Курс {} добавлен К группе {}',
    'create_new_course': 'Меню создания курса',
    'upload_files': 'Загрузите файлы на сервер',
    'settings': 'Настройки',
    'edit_course': 'Курс {}\n\n {}',
    'change_course_name': 'Введите новое имя курса',
    'change_course_description': 'Введите новое описание курса',
    'course_parts': 'Темы вашего курса',
    'course_part': '{}',
    'edit_part': 'Меню редактирования темы',
    'change_part_name': 'Введти новое имя темы',
    'check_home_work_per_part': 'Домашняя работа, которую сдали',
    'user_answer': 'Ответ Студента {}.\n\n{}',
    'put_mark': 'Поставить оценку {} {}\n\nВведите значение',
    'write_feedback': '{}\n\nВведите сообщени которое хотите отправить студенту {}',
    'add_theory_part': 'Выберите файлы',
    'tasks': 'Задания темы',
    'task': 'Задание {}\n\n{}',
    'change_task_name': 'Введите новое имя',
    'change_task_description': 'Введите новое описание',
    'add_files_task': 'Добавьте файлы к заданию',
    'tests': 'Ваши тесты'


}

